RoboMaster/ArduinoCore-imxrt/cores/arduino/USB/virtual_com.c
    switch (event)
    {
    case kUSB_DeviceEventBusReset:
    {
        s_cdcVcom.attach = 0;
        s_cdcVcom.currentConfiguration = 0U;
        error = kStatus_USB_Success;
#if (defined(USB_DEVICE_CONFIG_EHCI) && (USB_DEVICE_CONFIG_EHCI > 0U)) || \
    (defined(USB_DEVICE_CONFIG_LPCIP3511HS) && (USB_DEVICE_CONFIG_LPCIP3511HS > 0U))
        /* Get USB speed to configure the device, including max packet size and interval of the endpoints. */
        if (kStatus_USB_Success == USB_DeviceClassGetSpeed(CONTROLLER_ID, &s_cdcVcom.speed))
        {
            USB_DeviceSetSpeed(handle, s_cdcVcom.speed);
        }
#endif
    }
    break;
    case kUSB_DeviceEventSetConfiguration:
        if (0U == (*temp8))
        {
            s_cdcVcom.attach = 0;
            s_cdcVcom.currentConfiguration = 0U;
            error = kStatus_USB_Success;
        }
        else if (USB_CDC_VCOM_CONFIGURE_INDEX == (*temp8))
        {
            s_cdcVcom.attach = 1;
            s_cdcVcom.currentConfiguration = *temp8;
            error = kStatus_USB_Success;
            /* Schedule buffer for receive */
            USB_DeviceCdcAcmRecv(s_cdcVcom.cdcAcmHandle, USB_CDC_VCOM_BULK_OUT_ENDPOINT, s_currRecvBuf,
                                 g_UsbDeviceCdcVcomDicEndpoints[1].maxPacketSize);
        }
        else
        {
            /* no action, return kStatus_USB_InvalidRequest */
        }
        break;
    case kUSB_DeviceEventSetInterface:
        if (0U != s_cdcVcom.attach)
        {
            uint8_t interface = (uint8_t)((*temp16 & 0xFF00U) >> 0x08U);
            uint8_t alternateSetting = (uint8_t)(*temp16 & 0x00FFU);
            if (interface == USB_CDC_VCOM_COMM_INTERFACE_INDEX)
            {
                if (alternateSetting < USB_CDC_VCOM_COMM_INTERFACE_ALTERNATE_COUNT)
                {
                    s_cdcVcom.currentInterfaceAlternateSetting[interface] = alternateSetting;
                    error = kStatus_USB_Success;
                }
            }
            else if (interface == USB_CDC_VCOM_DATA_INTERFACE_INDEX)
            {
                if (alternateSetting < USB_CDC_VCOM_DATA_INTERFACE_ALTERNATE_COUNT)
                {
                    s_cdcVcom.currentInterfaceAlternateSetting[interface] = alternateSetting;
                    error = kStatus_USB_Success;
                }
            }
            else
            {
                /* no action, return kStatus_USB_InvalidRequest */
            }
        }
        break;
    case kUSB_DeviceEventGetConfiguration:
        if (NULL != param)
        {
            /* Get current configuration request */
            *temp8 = s_cdcVcom.currentConfiguration;
            error = kStatus_USB_Success;
        }
        break;
    case kUSB_DeviceEventGetInterface:
        if (NULL != param)
        {
            /* Get current alternate setting of the interface request */
            uint8_t interface = (uint8_t)((*temp16 & 0xFF00U) >> 0x08U);
            if (interface < USB_CDC_VCOM_INTERFACE_COUNT)
            {
                *temp16 = (*temp16 & 0xFF00U) | s_cdcVcom.currentInterfaceAlternateSetting[interface];
                error = kStatus_USB_Success;
            }
        }
        break;
    case kUSB_DeviceEventGetDeviceDescriptor:
        if (NULL != param)
        {
            error = USB_DeviceGetDeviceDescriptor(handle, (usb_device_get_device_descriptor_struct_t *)param);
        }
        break;
    case kUSB_DeviceEventGetConfigurationDescriptor:
        if (NULL != param)
        {
            error = USB_DeviceGetConfigurationDescriptor(handle,
                                                         (usb_device_get_configuration_descriptor_struct_t *)param);
        }
        break;
    case kUSB_DeviceEventGetStringDescriptor:
        if (NULL != param)
        {
            /* Get device string descriptor request */
            error = USB_DeviceGetStringDescriptor(handle, (usb_device_get_string_descriptor_struct_t *)param);
        }
        break;
    default:
        /* no action, return kStatus_USB_InvalidRequest */
        break;
    }

    return error;
}

static void CDC_VCOM_BMEnterCritical(uint32_t *sr)
{
    *sr = DisableGlobalIRQ();
}

static void CDC_VCOM_BMExitCritical(uint32_t sr)
{
    EnableGlobalIRQ(sr);
}

/*!
 * @brief Application initialization function.
 *
 * This function initializes the application.
 *
 * @return None.
 */
void vcom_cdc_init(void)
{
    USB_DeviceClockInit();
#if (defined(FSL_FEATURE_SOC_SYSMPU_COUNT) && (FSL_FEATURE_SOC_SYSMPU_COUNT > 0U))
    SYSMPU_Enable(SYSMPU, 0);
#endif /* FSL_FEATURE_SOC_SYSMPU_COUNT */

    s_cdcVcom.speed = USB_SPEED_FULL;
    s_cdcVcom.attach = 0;
    s_cdcVcom.cdcAcmHandle = (class_handle_t)NULL;
    s_cdcVcom.deviceHandle = NULL;

    if (kStatus_USB_Success != USB_DeviceClassInit(CONTROLLER_ID, &s_cdcAcmConfigList, &s_cdcVcom.deviceHandle))
    {
        usb_echo("USB device init failed\r\n");
    }
    else
    {
        usb_echo("USB device CDC virtual com demo\r\n");
        s_cdcVcom.cdcAcmHandle = s_cdcAcmConfigList.config->classHandle;
    }

    USB_DeviceIsrEnable();

    /*Add one delay here to make the DP pull down long enough to allow host to detect the previous disconnection.*/
    SDK_DelayAtLeastUs(5000, SDK_DEVICE_MAXIMUM_CPU_CLOCK_FREQUENCY);
    USB_DeviceRun(s_cdcVcom.deviceHandle);
}

// 给USBCDC.CPP调用
//////////////////////////////////////////////////////////////

// 由中断调用，将系统s_currRecvBuf中的数据读取出来传出去
uint8_t vcom_get_recBuf(void *data)
{
    uint8_t length = 0;
    uint32_t usbOsaCurrentSr;

    if ((0 != s_recvSize) && (USB_CANCELLED_TRANSFER_LENGTH != s_recvSize))
    {
        // 进入临界区保证拷贝操作不会被打断
        CDC_VCOM_BMEnterCritical(&usbOsaCurrentSr);
        if ((0U != s_recvSize) && (USB_CANCELLED_TRANSFER_LENGTH != s_recvSize))
        {
            /* Copy Buffer to data */
            memcpy(data, s_currRecvBuf, s_recvSize);
            length = s_recvSize;
            s_recvSize = 0;
        }
        CDC_VCOM_BMExitCritical(usbOsaCurrentSr);
    }

