RoboMaster/ArduinoCore-imxrt/cores/arduino/USB/virtual_com.c
    return length;
}

// USBCDC::write 调用 通过CDC发送数据
status_t vcom_write_buf(void *data, uint32_t size)
{
    if ((1 == s_cdcVcom.attach) && (1 == s_cdcVcom.startTransactions))
    {
        usb_status_t error = kStatus_USB_Error;

        s_waitForDataSend = 0;

        error = USB_DeviceCdcAcmSend(s_cdcVcom.cdcAcmHandle, USB_CDC_VCOM_BULK_IN_ENDPOINT, (uint8_t *)data, size);
        if (error != kStatus_USB_Success)
        {
            /* Failure to send Data Handling code here */
            return 0;
        }

        // 等待本次发送完成，在发送中断中会将该标志位置1
        // 没有该等待的话，内容会被覆盖导致发送不完成整
        while (!s_waitForDataSend);

        return 1;
    }
    return 0;
}

// void APPTask()
// {
//     uint8_t buff[512];

//     if ((1U == s_cdcVcom.attach) && (1U == s_cdcVcom.startTransactions))
//     {
//         uint8_t data[64];
//         uint32_t length;
//         length = vcom_get_recBuf(data);

//         vcom_read_buf(buff, 512);

//         if (s_recvSize != 0)
//         {
//             vcom_write_buf(buff, s_recvSize);

//             PRINTF("s_recving:%d\r\n", s_recvSize);

//             s_recvSize = 0;
//         }
//     }
// }

// void APPTask(void)
// {
//     usb_status_t error = kStatus_USB_Error;
//     uint32_t usbOsaCurrentSr;

//     if ((1U == s_cdcVcom.attach) && (1U == s_cdcVcom.startTransactions))
//     {
//         /* Enter critical can not be added here because of the loop */
//         /* endpoint callback length is USB_CANCELLED_TRANSFER_LENGTH (0xFFFFFFFFU) when transfer is canceled */
//         if ((0 != s_recvSize) && (USB_CANCELLED_TRANSFER_LENGTH != s_recvSize))
//         {
//             /* The operating timing sequence has guaranteed there is no conflict to access the s_recvSize between USB
//                ISR and this task. Therefore, the following code of Enter/Exit ctitical mode is useless,
//                only to mention users the exclusive access of s_recvSize if users implement their own
//                application referred to this SDK demo */
//             CDC_VCOM_BMEnterCritical(&usbOsaCurrentSr);
//             if ((0U != s_recvSize) && (USB_CANCELLED_TRANSFER_LENGTH != s_recvSize))
//             {
//                 /* Copy Buffer to Send Buff */
//                 memcpy(s_currSendBuf, s_currRecvBuf, s_recvSize);
//                 s_sendSize = s_recvSize;
//                 s_recvSize = 0;
//             }
//             CDC_VCOM_BMExitCritical(usbOsaCurrentSr);
//         }

//         if (0U != s_sendSize)
//         {
//             uint32_t size = s_sendSize;
//             s_sendSize = 0;

//             error = USB_DeviceCdcAcmSend(s_cdcVcom.cdcAcmHandle, USB_CDC_VCOM_BULK_IN_ENDPOINT, s_currSendBuf, size);

//             if (error != kStatus_USB_Success)
//             {
//                 /* Failure to send Data Handling code here */
//             }
//         }
// #if defined(FSL_FEATURE_USB_KHCI_KEEP_ALIVE_ENABLED) && (FSL_FEATURE_USB_KHCI_KEEP_ALIVE_ENABLED > 0U) && \
//     defined(USB_DEVICE_CONFIG_KEEP_ALIVE_MODE) && (USB_DEVICE_CONFIG_KEEP_ALIVE_MODE > 0U) &&             \
//     defined(FSL_FEATURE_USB_KHCI_USB_RAM) && (FSL_FEATURE_USB_KHCI_USB_RAM > 0U)
//         if ((s_waitForDataReceive))
//         {
//             if (s_comOpen == 1)
//             {
//                 /* Wait for all the packets been sent during opening the com port. Otherwise these packets may
//                  * wake up the system.
//                  */
//                 usb_echo("Waiting to enter lowpower ...\r\n");
//                 for (uint32_t i = 0U; i < 16000000U; ++i)
//                 {
//                     __NOP(); /* delay */
//                 }

//                 s_comOpen = 0;
//             }
//             usb_echo("Enter lowpower\r\n");
//             BOARD_DbgConsole_Deinit();
//             USB0->INTEN &= ~USB_INTEN_TOKDNEEN_MASK;
//             USB_EnterLowpowerMode();

//             s_waitForDataReceive = 0;
//             USB0->INTEN |= USB_INTEN_TOKDNEEN_MASK;
//             BOARD_DbgConsole_Init();
//             usb_echo("Exit  lowpower\r\n");
//         }
// #endif
//     }
// }

// #if defined(__CC_ARM) || (defined(__ARMCC_VERSION)) || defined(__GNUC__)
// int main(void)
// #else
// void main(void)
// #endif
// {
//     BOARD_ConfigMPU();

//     BOARD_InitBootPins();
//     BOARD_InitBootClocks();
//     BOARD_InitDebugConsole();

//     APPInit();

//     while (1)
//     {
//         APPTask();

// #if USB_DEVICE_CONFIG_USE_TASK
//         USB_DeviceTaskFn(s_cdcVcom.deviceHandle);
// #endif
//     }
// }

// // USBCDC::init USBCDC::read USBCDC::flush 调用
// uint32_t vcom_read(uint32_t length)
// {
//     usb_status_t error = kStatus_USB_Error;
//     if ((1 == s_cdcVcom.attach) && (1 == s_cdcVcom.startTransactions))
//     {
//         /* Schedule buffer for next receive event */
//         error = USB_DeviceCdcAcmRecv(s_cdcVcom.cdcAcmHandle, USB_CDC_VCOM_BULK_OUT_ENDPOINT, s_currRecvBuf, length);
//         if (kStatus_USB_Success != error)
//         {
//             return 0;
//         }
//     }
//     // TODO :此处有疑问，是否需要return1，是什么含义
//     return 1;
// }
// uint32_t vcom_read_buf(void *data, uint32_t length)
// {
//     usb_status_t error = kStatus_USB_Error;

//     if ((1U == s_cdcVcom.attach) && (1U == s_cdcVcom.startTransactions))
//     {
//         /* Schedule buffer for next receive event */
//         error = USB_DeviceCdcAcmRecv(s_cdcVcom.cdcAcmHandle, USB_CDC_VCOM_BULK_OUT_ENDPOINT, s_currRecvBuf, length);
//         if (kStatus_USB_Success != error)
//         {
//             return 0;
//         }
//     }

//     if (s_recvSize != 0)
//     {
//         uint8_t *ptr = data;

//         for (uint32_t i = 0; i < s_recvSize; i++)
//         {
//             *(ptr++) = s_currRecvBuf[i];
//         }
//     }
//     length = s_recvSize;
//     s_recvSize = 0;
//     return length;
// }